---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FilledRegionMasking
source: html/b9966899-51b2-9f15-c555-96dbffa9f36b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FilledRegionMasking Property

"Masking"

## Syntax (C#)
```csharp
public static ForgeTypeId FilledRegionMasking { get; }
```